class Address {
    var index: Int = (100000..999999).random()
    var country = "Россия"
    var region: String = regions.random()
    var city: String = cities.random()
    var street: String = streets.random()
    var apt: Int = (1..199).random()
    var flat: Int = (1..99).random()
}

val regions = arrayOf("Москва", "Московская область", "Тульская область", "Республика Адыгея", "Республика Ингушетия", "Республика Коми",
    "Республика Крым", "Краснодарский край", "Красноярский край", "Хабаровский край", "Архангельская область", "Ивановская область",
    "Иркутская область", "Кировская область", "Липецкая область", "Оренбургская область", "Орловская область", "Томская область", "Тюменская область",
    "Чукотский АО", "Ненецкий АО", "Челябинская область")

val cities = arrayOf("Москва", "Санкт-Петербург", "Тула", "Севастополь", "Калуга", "Воронеж", "Орел", "Ясногорск", "Ялта",
    "Пермь", "Петрозаводск", "Сочи", "Новороссийск", "Анапа", "Нефтеюганск", "Мурманск", "Екатеринбург", "Владивосток",
    "Астрахань", "Рязань", "Челябинск", "Махачкала", "Саратов", "Кострома", "Сахалин", "Ярославль", "Елец")

val streets = arrayOf("Волховская", "Кирова", "Верещагина", "Проспект Ленина", "Пушкинская", "Замочная", "Агейная", "Бассейная",
    "Болдина", "Гастелло", "Металлургов", "Головина", "Галкина", "Гончарова", "Дальняя", "Жаворонкова", "Беляева", "Кауля",
    "Пролетарская", "Карла Маркса", "Каширская", "Клюева", "Кулибина", "Кутузова", "Песчаная", "Рудная", "Пузакова")